OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f45j50.h
extern __at(0x0F5D) volatile __PMMODEHbits_t PMMODEHbits;

#define _MODE0                  0x01
#define _MODE1                  0x02
#define _MODE16                 0x04
#define _INCM0                  0x08
#define _INCM1                  0x10
#define _IRQM0                  0x20
#define _IRQM1                  0x40
#define _BUSY                   0x80

//==============================================================================


//==============================================================================
//        PMCONL Bits

extern __at(0x0F5E) __sfr PMCONL;

typedef union
  {
  struct
    {
    unsigned RDSP               : 1;
    unsigned WRSP               : 1;
    unsigned BEP                : 1;
    unsigned CS1P               : 1;
    unsigned CS2P               : 1;
    unsigned ALP                : 1;
    unsigned CSF0               : 1;
    unsigned CSF1               : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CSF                : 2;
    };
  } __PMCONLbits_t;

extern __at(0x0F5E) volatile __PMCONLbits_t PMCONLbits;

#define _RDSP                   0x01
#define _WRSP                   0x02
#define _BEP                    0x04
#define _CS1P                   0x08
#define _CS2P                   0x10
#define _ALP                    0x20
#define _CSF0                   0x40
#define _CSF1                   0x80

//==============================================================================


//==============================================================================
//        PMCONH Bits

extern __at(0x0F5F) __sfr PMCONH;

typedef union
  {
  struct
    {
    unsigned PTRDEN             : 1;
    unsigned PTWREN             : 1;
    unsigned PTBEEN             : 1;
    unsigned ADRMUX0            : 1;
    unsigned ADRMUX1            : 1;
    unsigned PSIDL              : 1;
    unsigned                    : 1;
    unsigned PMPEN              : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned ADRMUX             : 2;
    unsigned                    : 3;
    };
  } __PMCONHbits_t;

extern __at(0x0F5F) volatile __PMCONHbits_t PMCONHbits;

#define _PTRDEN                 0x01
#define _PTWREN                 0x02
#define _PTBEEN                 0x04
#define _ADRMUX0                0x08
#define _ADRMUX1                0x10
#define _PSIDL                  0x20
#define _PMPEN                  0x80

//==============================================================================

extern __at(0x0F60) __sfr UFRM;

//==============================================================================
//        UFRML Bits

extern __at(0x0F60) __sfr UFRML;

typedef struct
  {
  unsigned FRM0                 : 1;
  unsigned FRM1                 : 1;
  unsigned FRM2                 : 1;
  unsigned FRM3                 : 1;
  unsigned FRM4                 : 1;
  unsigned FRM5                 : 1;
  unsigned FRM6                 : 1;
  unsigned FRM7                 : 1;
  } __UFRMLbits_t;

extern __at(0x0F60) volatile __UFRMLbits_t UFRMLbits;

#define _FRM0                   0x01
#define _FRM1                   0x02
#define _FRM2                   0x04
#define _FRM3                   0x08
#define _FRM4                   0x10
#define _FRM5                   0x20
#define _FRM6                   0x40
#define _FRM7                   0x80

//==============================================================================


//==============================================================================
//        UFRMH Bits

extern __at(0x0F61) __sfr UFRMH;

typedef struct
  {
  unsigned FRM8                 : 1;
  unsigned FRM9                 : 1;
  unsigned FRM10                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UFRMHbits_t;

extern __at(0x0F61) volatile __UFRMHbits_t UFRMHbits;

#define _FRM8                   0x01
#define _FRM9                   0x02
#define _FRM10                  0x04

//==============================================================================


//==============================================================================
//        UIR Bits

extern __at(0x0F62) __sfr UIR;

typedef struct
  {
  unsigned URSTIF               : 1;
  unsigned UERRIF               : 1;
  unsigned ACTVIF               : 1;
  unsigned TRNIF                : 1;
  unsigned IDLEIF               : 1;
  unsigned STALLIF              : 1;
  unsigned SOFIF                : 1;
  unsigned                      : 1;
  } __UIRbits_t;

extern __at(0x0F62) volatile __UIRbits_t UIRbits;

#define _URSTIF                 0x01
#define _UERRIF                 0x02
#define _ACTVIF                 0x04
#define _TRNIF                  0x08
#define _IDLEIF                 0x10
#define _STALLIF                0x20
#define _SOFIF                  0x40

//==============================================================================


//==============================================================================
//        UEIR Bits

extern __at(0x0F63) __sfr UEIR;

typedef struct
  {
  unsigned PIDEF                : 1;
  unsigned CRC5EF               : 1;
  unsigned CRC16EF              : 1;
  unsigned DFN8EF               : 1;
  unsigned BTOEF                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned BTSEF                : 1;
  } __UEIRbits_t;

extern __at(0x0F63) volatile __UEIRbits_t UEIRbits;

#define _PIDEF                  0x01
#define _CRC5EF                 0x02
#define _CRC16EF                0x04
#define _DFN8EF                 0x08
#define _BTOEF                  0x10
#define _BTSEF                  0x80

//==============================================================================


//==============================================================================
//        USTAT Bits

extern __at(0x0F64) __sfr USTAT;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned PPBI               : 1;
    unsigned DIR                : 1;
    unsigned ENDP0              : 1;
    unsigned ENDP1              : 1;
    unsigned ENDP2              : 1;
    unsigned ENDP3              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned ENDP               : 4;
    unsigned                    : 1;
    };
  } __USTATbits_t;

extern __at(0x0F64) volatile __USTATbits_t USTATbits;

#define _PPBI                   0x02
#define _DIR                    0x04
#define _ENDP0                  0x08
#define _ENDP1                  0x10
#define _ENDP2                  0x20
#define _ENDP3                  0x40

//==============================================================================


//==============================================================================
//        UCON Bits

extern __at(0x0F65) __sfr UCON;

typedef struct
  {
  unsigned                      : 1;
  unsigned SUSPND               : 1;
  unsigned RESUME               : 1;
  unsigned USBEN                : 1;
  unsigned PKTDIS               : 1;
  unsigned SE0                  : 1;
  unsigned PPBRST               : 1;
  unsigned                      : 1;
  } __UCONbits_t;

extern __at(0x0F65) volatile __UCONbits_t UCONbits;

#define _SUSPND                 0x02
#define _RESUME                 0x04
#define _USBEN                  0x08
#define _PKTDIS                 0x10
#define _SE0                    0x20
#define _PPBRST                 0x40

//==============================================================================

extern __at(0x0F66) __sfr DMABCH;
extern __at(0x0F67) __sfr DMABCL;
extern __at(0x0F68) __sfr RXADDRH;
extern __at(0x0F69) __sfr RXADDRL;
extern __at(0x0F6A) __sfr TXADDRH;
extern __at(0x0F6B) __sfr TXADDRL;
extern __at(0x0F6C) __sfr PMDIN1L;
extern __at(0x0F6D) __sfr PMDIN1H;
extern __at(0x0F6E) __sfr PMADDRL;
extern __at(0x0F6E) __sfr PMDOUT1L;

//==============================================================================
//        PMADDRH Bits

